# 1
# n = int(input("Введите число: "))
# if n / n and n / 1 and not n % 2 == 0:
#     print(f'{n} является простым числом')
# else:
#     print(f'{n} не является простым числом')
# =================================================================================
# 2
# nums = [1, 2, 6, 3, 4, 5, 7, 8, 9, 1]
# print(sorted(nums))
# =================================================================================
# 3
# nums = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]
# print(max(nums))
# =================================================================================
# 4
# n = int(input("Введите номер числа Фибоначчи: "))
#
# def fib(n):
#     if n <= 0:
#         print("Число не может быть меньше 0")
#     elif n == 1:
#         print(0)
#     elif n == 2:
#         print(1)
#     else:
#         c = 0
#         cur = 1
#         for i in range(3, n + 1):
#             next = c + cur
#             c = cur
#             cur = next
#         return cur
#
#
# result = fib(n)
# print(result)
# ==================================================================================
